init_funds = 122388

bill_list = [
    {
        "date": "2021-09-10",
        "type": 1,
        "money": 5000,
    },
    {
        "date": "2021-09-15",
        "type": 0,
        "money": 2990,
    },

    {
        "date": "2021-10-05",
        "type": 0,
        "money": 17234,
    },
    {
        "date": "2021-10-15",
        "type": 0,
        "money": 2990,
    },
    {
        "date": "2021-10-04",
        "type": 0,
        "money": 2783,
    },
    {
        "date": "2021-10-05",
        "type": 1,
        "money": 5000,
    },
    {
        "date": "2021-10-05",
        "type": 1,
        "money": 2500,
    },
    {
        "date": "2021-10-04",
        "type": 1,
        "money": 7500,
        "notes": "现在房租"
    },
    {
        "date": "2021-10-02",
        "type": 1,
        "money": 8349,
        "notes": "自如房租"
    },


    {
        "date": "2021-11-05",
        "type": 0,
        "money": 17234,
    },
    {
        "date": "2021-11-15",
        "type": 0,
        "money": 2990,
    },
    {
        "date": "2021-11-04",
        "type": 0,
        "money": 2783,
    },
    {
        "date": "2021-11-05",
        "type": 1,
        "money": 5000,
    },
    {
        "date": "2021-11-05",
        "type": 1,
        "money": 2500,
    },

    {
        "date": "2021-12-05",
        "type": 0,
        "money": 17234,
    },
    {
        "date": "2021-12-15",
        "type": 0,
        "money": 2990,
    },
    {
        "date": "2021-12-04",
        "type": 0,
        "money": 2783,
    },
    {
        "date": "2021-12-05",
        "type": 1,
        "money": 5000,
    },
    {
        "date": "2021-12-05",
        "type": 1,
        "money": 2500,
    },

    {
        "date": "2022-01-05",
        "type": 0,
        "money": 17234,
    },
    {
        "date": "2022-01-15",
        "type": 0,
        "money": 2990,
    },
    {
        "date": "2022-01-04",
        "type": 0,
        "money": 2783,
    },
    {
        "date": "2022-01-04",
        "type": 0,
        "money": 3000,
        "notes": "大哥欠款",
    },
    {
        "date": "2022-01-05",
        "type": 1,
        "money": 5000,
    },
    {
        "date": "2022-01-05",
        "type": 1,
        "money": 2500,
    },
    {
        "date": "2022-01-04",
        "type": 1,
        "money": 7500,
        "notes": "现在房租"
    },
    {
        "date": "2022-01-02",
        "type": 1,
        "money": 8349,
        "notes": "自如房租"
    },

    {
        "date": "2022-02-05",
        "type": 0,
        "money": 17234,
    },
    {
        "date": "2022-02-15",
        "type": 0,
        "money": 2990,
    },
    {
        "date": "2022-02-04",
        "type": 0,
        "money": 2783,
    },
    {
        "date": "2022-02-05",
        "type": 1,
        "money": 5000,
    },
    {
        "date": "2022-02-05",
        "type": 1,
        "money": 2500,
    },


    {
        "date": "2022-03-05",
        "type": 0,
        "money": 17234,
    },
    {
        "date": "2022-03-15",
        "type": 0,
        "money": 2990,
    },
    {
        "date": "2022-03-04",
        "type": 0,
        "money": 2783,
    },
    {
        "date": "2022-03-05",
        "type": 1,
        "money": 5000,
    },
    {
        "date": "2022-03-05",
        "type": 1,
        "money": 2500,
    },

    {
        "date": "2022-04-05",
        "type": 0,
        "money": 17234,
    },
    {
        "date": "2022-04-15",
        "type": 0,
        "money": 2990,
    },
    {
        "date": "2022-04-01",
        "type": 0,
        "money": 2530,
        "notes": "自如退押金"
    },
    {
        "date": "2022-04-01",
        "type": 1,
        "money": 2808,
        "notes": "退给胡小垒押金2530，加上多余3天租金278，共2808"
    },
    {
        "date": "2022-04-05",
        "type": 1,
        "money": 5000,
    },
    {
        "date": "2022-04-05",
        "type": 1,
        "money": 2500,
    },
    {
        "date": "2022-04-04",
        "type": 1,
        "money": 7500,
        "notes": "现有房租"
    },

    {
        "date": "2022-05-05",
        "type": 0,
        "money": 17234,
    },
    {
        "date": "2022-05-15",
        "type": 0,
        "money": 2990,
    },
    {
        "date": "2022-05-05",
        "type": 1,
        "money": 5000,
    },
    {
        "date": "2022-05-05",
        "type": 1,
        "money": 2500,
    },

    {
        "date": "2022-06-05",
        "type": 0,
        "money": 17234,
    },
    {
        "date": "2022-06-15",
        "type": 0,
        "money": 2990,
    },
    {
        "date": "2022-06-05",
        "type": 1,
        "money": 5000,
    },
    {
        "date": "2022-06-05",
        "type": 1,
        "money": 2500,
    },

    {
        "date": "2022-07-05",
        "type": 0,
        "money": 17234,
    },
    {
        "date": "2022-07-15",
        "type": 0,
        "money": 2990,
    },
    {
        "date": "2022-07-05",
        "type": 1,
        "money": 5000,
    },
    {
        "date": "2022-07-05",
        "type": 1,
        "money": 2500,
    },
    {
        "date": "2022-07-04",
        "type": 0,
        "money": 2500,
        "notes": "退押金"
    }

]